from module1 import * 
# Напишите функцию kool(), при запуске которой происходит заполнение двух списков: opilased[], puudumised[].
# После заполнения списков появляется меню с выбором действий:
# • Узнать n лучших учеников;
# • Упорядочить список в порядке возрастания прогулов. отобразить прогулы вместе с фамилиями учеников;
# • Вывести список учеников отправленных на комиссию ( критерий придумать самостоятельно);
# • Отчислить(удалить из списка)  учеников, у которых прогулов больше чем 100;
# • Свой вариант.
# Для решения задачи используйте функции.

# Списки


print(kool(opilased, puudumised))


# После заполнения списков появляется меню с выбором действий
# Меню с выбором действий
print("1. Узнать n лучших учеников")
print("2. Упорядочить список в порядке возрастания прогулов. отобразить прогулы вместе с фамилиями учеников")
print("3. Вывести список учеников отправленных на комиссию ( критерий придумать самостоятельно)")
print("4. Отчислить(удалить из списка)  учеников, у которых прогулов больше чем 100")
print("5. Свой вариант")
